{
	"quests.desc.1":"Upon starting a new chapter, new ingridents must be added to the menu to progress reputation.",
	"quests.desc.2":"Specifically, you need at least &eThree&r types new ingridents in menu to progress the reputation in this chapter.",
	"quests.subtl.1":"Add three types of new ingridents in menu to progress reputation.",
	"quests.title.1":"Begin Chapter 2",
	"quests.title.2":"Begin Chapter 3",
	"quests.desc.3":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.4":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.5":"to bind workstations.",
	"quests.subtl.2":"...or just buy fishes?",
	"quests.title.3":"Buy fishing equipments from Fisherman",
	"quests.desc.6":"Fish Traps must be waterlogged and next to at least one block of water to work.",
	"quests.desc.7":"Use show recipe (default by U) on fish traps reveals available baits.",
	"quests.desc.8":"Crab Traps require fishes (or chum buckets) as bait to catch crabs (and non-crab crustaceans).",
	"quests.desc.9":"More water blocks around increases efficiency.",
	"quests.subtl.3":"Using chum buckets is recommended.",
	"quests.title.4":"Chapter 2: Seafood in Skyblock",
	"quests.title.5":"Random Trim Template",
	"quests.title.6":"Creative Blaze Cake",
	"quests.title.7":"Creative Storage Upgrade",
	"quests.title.8":"Creative Engine",
	"quests.title.9":"Random Ancient Tome",
	"quests.title.10":"Creative Motor",
	"quests.title.11":"Creative Wand",
	"quests.desc.10":"You've done it, you made it here, created your ideal burgeria... And now you unlocked the Shop at the End of the Game.",
	"quests.desc.11":"Where you can spend massive amount of money for really powerful items.",
	"quests.desc.12":"This part isn't must-play contents but a goal for those who don't want to quit after reaching the end, therefore it is heavily imbalanced, please don't be offended.",
	"quests.subtl.4":"What now?",
	"quests.title.12":"You reached the end...",
	"quests.title.13":"Feather of Raphael",
	"quests.title.14":"Feather of Gabirel",
	"quests.title.15":"Eternal Codex",
	"quests.title.16":"Rumia Hairband",
	"quests.title.17":"The Shop at the End of the Game",
	"quests.desc.13":"You will find a 'counter' block on your island.",
	"quests.desc.14":"Which is all your burgeria is about.",
	"quests.desc.15":"Please don't lose it.",
	"quests.desc.16":"All contents of this modpack are available in peaceful mode.",
	"quests.desc.17":"Playing with a friend is suggested for best experience.",
	"quests.subtl.5":"Biggest Starting Island Ever",
	"quests.title.18":"Begin Your Journey",
	"quests.desc.18":"The &l&eList Filter&r is the menu for your burgeria.",
	"quests.desc.19":"Put appropriate ingridents in the list filter and right click the counter with it to set the menu.",
	"quests.desc.20":"The burgeria can only open with an approprite menu.",
	"quests.desc.21":"The menu require at least three ingridents that is neither bread nor sauce.",
	"quests.desc.22":"To close the burgeria, simply switch the list filter to deny-list and right click the counter.",
	"quests.desc.23":"The &l&eClipboard&r can be used to write down the orders.",
	"quests.desc.24":"When a customer is present, right click the counter with clipboard in off hand and a feather in main hand to write down the order.",
	"quests.desc.25":"And once you completed the order, right click the counter with the burger for delivery.",
	"quests.subtl.6":"How to Run Your Burgeria?",
	"quests.title.19":"Menu and Clipboard",
	"quests.desc.26":"You will receive coins upon delivery.",
	"quests.desc.27":"These coins can be used to buy animals, crops or resources from villagers later.",
	"quests.desc.28":"Use the &e/bank commands &rto save to/extract from a bank account.",
	"quests.desc.29":"&e/bank-save&r will save all the coins in your inventory.",
	"quests.desc.30":"&e/bank-extract [Number]&r will extract certain amount of money.",
	"quests.desc.31":"&e/bank&r to show your balance.",
	"quests.desc.32":"You can also use the Mini Banker to quickly exchange coins.",
	"quests.desc.33":"",
	"quests.desc.34":"Specifically;",
	"quests.desc.35":"Hold the Mini Banker &ein Main hand&r and &eRight Click&r to exchange the coin in off hand to lower tier. &eShift+Right Click&r to exchange the entire stack in offhand to lower tier.",
	"quests.desc.36":"Hold the Mini Banker &ein Off hand&r and &eRight Click&r to exchaCnge the coin in main hand to higher tier. &eShift+Right Click&r to exchange all coin in inventory to the highest tier.",
	"quests.subtl.7":"Mini Banker!",
	"quests.title.20":"Economic \\\u0026 Coin",
	"quests.desc.37":"Plant down tomato, cabbage and wheat seeds, and raise some chickens;",
	"quests.desc.38":"&eTomato slices, Cabbage leaf and Fried egg &rare the only available ingridents early in game.",
	"quests.desc.39":"...or Cooked Chicken Cuts, if you have enough chickens.",
	"quests.desc.40":"Anyways, with enough ingredients, once you put them in the list filter and set up the menu, you can start your business.",
	"quests.desc.41":"Customers would only arrive during daytime and would leave at night, so keep track of time!",
	"quests.subtl.8":"Tomato, Lettuce \\\u0026 Eggs",
	"quests.title.21":"The Grand Opening",
	"quests.desc.42":"In this modpack, most resources are obtained through villager trading.",
	"quests.desc.43":"Of course, there are resources easily obtainable in early stages.",
	"quests.desc.44":"For example: &eRight Click Cobblestone with any Pickaxes&r could turn it into &eGravel&r, right click again to turn it into &eSand&r and &eClay&r.",
	"quests.subtl.9":"Where is Ex Nihilo?",
	"quests.title.22":"I need some resources!",
	"quests.desc.45":"Use Grindstone to bind a villager to Weaponsmith.",
	"quests.desc.46":"Instead of selling weapons, weaponsmiths now sell ores.",
	"quests.desc.47":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.48":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.49":"to bind workstations.",
	"quests.subtl.10":"Using the money earned from selling burgers",
	"quests.title.23":"Buy ores from Weaponsmith",
	"quests.desc.50":"There are four types of ingridents: &eMeat, Veggies, Sauce and Misc&r",
	"quests.desc.51":"Customers would &eRandomly&r pick ingridents from the menu, and would continue when picked an ingrident of new category.",
	"quests.desc.52":"Otherwise, there's a possibility to stop the process by the 'Odds to End Order' property of ingridents.",
	"quests.desc.53":"Besides that, picking a picked ingrident has a 50% chance to end order.",
	"quests.desc.54":"&eBread&r works different; Customers would randomly choose from paired breads in the menu, and would choose the default bread when no pairs are present.",
	"quests.desc.55":"",
	"quests.desc.56":"To summarize:",
	"quests.desc.57":"&eCustomers would at least order two layers of ingridents&r;",
	"quests.desc.58":"The more diversed and balanced the menu is, the more likely that customers would order a bigger burger;",
	"quests.desc.59":"The higher 'Odds to End Order' is, the more likely that customers would order a smaller burger;",
	"quests.desc.60":"Since the size and diversity of burgers are directly related to income and reputation, the more diversed menu, the better.",
	"quests.desc.61":" ",
	"quests.desc.62":"Besides that, ingridents have &ePrice&r and &eExtra Price&r properties.",
	"quests.desc.63":"Price is simple: Every time you sell one of this in a burger you receive a fixed amount of money.",
	"quests.desc.64":"But Extra Price is different: &eIt only trigger once per unique ingrident, &rand it adds up according to &eHow many unique ingridents are there.&r",
	"quests.desc.65":"For example: A regular burger with two tomato slices:",
	"quests.desc.66":"The final price is (1+1+2+2) (Price) +(1*3) (Extra Price) =9",
	"quests.desc.67":"A regular burger with one tomato slice and a cabbage leaf:",
	"quests.desc.68":"The final price is (1+1+2+2) (Price) +(1*4+1*4) (Extra Price) =14",
	"quests.desc.69":"Therefore, the Extra Price is a powerful property that can easily yield a generous income in large burgers.",
	"quests.subtl.11":"If you fail to understand just read the second page.",
	"quests.title.24":"Know your Ingridents",
	"quests.desc.70":"In this modpack, all hostile mobs &ewould not attack the player&r.",
	"quests.desc.71":"Although they would still target villagers, the villagers are immune to most damage.",
	"quests.desc.72":"Monsters are no longer threats but could still be annoying. If you find so you could place a Mega Torch.",
	"quests.subtl.12":"Friendly Monsters",
	"quests.title.25":"Checked",
	"quests.title.26":"The True Peaceful Mode",
	"quests.desc.73":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.74":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.75":"to bind workstations.",
	"quests.title.27":"Buy building materials from Mason",
	"quests.desc.76":"Mason and Farmer sells andersite, and Weaponsmith sells iron ore.",
	"quests.desc.77":"Although blaze burners are unobtainable until chaper 4, &eBrass has a new recipe where you can smelt crushed brass (made from mixing crushed copper and zinc) to obtain brass, without using blaze burners.",
	"quests.desc.78":"Create isn't necessary for progressing in this modpack, but it could improve your experience.",
	"quests.desc.79":"All create blocks have a built-in tutorial by &ePress W to Ponder&r, or you can find more in-depth tutorials on youtube.",
	"quests.subtl.13":"Create!",
	"quests.title.28":"Create",
	"quests.desc.80":"&eReputation&r will show up upon delivered an order.",
	"quests.desc.81":"Complete the order accroding to customer demands would raise your reputation, and it's the other way around: If you give a stash of potatos to customers you would lose reputation.",
	"quests.desc.82":"&8&m(Yes, SAR have special models for raw potatos, which I found hilarious.)&r&r",
	"quests.desc.83":"Anyways, reputation would affect your income, &eEvery level of reputation would boost all price by 20%.&r",
	"quests.desc.84":"Which means all burgers sold on 5 reputation level yields twice as much.",
	"quests.desc.85":"",
	"quests.desc.86":"Before you hit 25 reputation level, every &efive&r levels of reputation takes you into a new chaper.",
	"quests.desc.87":"Then, Right click the counter with a paper to get a &eCertificate&r--certificates can be used to obtain ingridents and items of the chapter. Ingridents in later chapters would raise more reputation.",
	"quests.desc.88":"Upon entering a new chapter, you &emust&r add three types of ingridents of the new chapter to continue growing your reputation. The restriction is lifted once you hit 25 level of reputation.",
	"quests.subtl.14":"To make your burgeria more famous!",
	"quests.title.29":"Reputation and Certificates",
	"quests.desc.89":"Moving counter was not designed when making this modpack... That's why this is a skyblock modpack, because an immobile settlement in regular world is just annoying.",
	"quests.desc.90":"But it turns out that it's still annoying.",
	"quests.desc.91":"So we have this.",
	"quests.desc.92":"Right click the counter with Transport Tool can turn it into an item. DON'T LOSE IT OR YOU WILL LOSE YOUR PROGRESS PERMENANTLY!",
	"quests.desc.93":"Also, you can't rotate your counter. Customers would always arrive on the x-axis in the positive z direction. So prepare before you put down your counter.",
	"quests.subtl.15":"PLEASE DON'T LOSE IT",
	"quests.title.30":"Move your Counter",
	"quests.desc.94":"There's an abandoned inn on your island. After clearing out the cobwebs you can 'add room' with the blueprint inside the building. Then, The Inn is recognized as a valid Inn.",
	"quests.desc.95":"Then adventurers will come to visit and you can invite them to join your village.",
	"quests.desc.96":"&cIf you didn't ask them to stay, they will still leave even if you assigned work for them!",
	"quests.desc.97":"&eRight click->Talk->Ask to stay&r",
	"quests.desc.98":"&eAfter adventurers turned into unemployed villagers, they are villagers of your village.",
	"quests.desc.99":"Villager trading is necessary in this modpack!",
	"quests.desc.100":"You can add the other two houses as rooms to provide living space for villagers.",
	"quests.desc.101":"&eIf they're still saying there's not enough room, it's a MCA bug. You could break the beds, reload the building, place it back and reload again. Usually it could fix this problem.&r",
	"quests.subtl.16":"Build your Very Own Village!",
	"quests.title.31":"Minecraft Comes Alive",
	"quests.desc.102":"Yeah, a craftable String Duper block.",
	"quests.desc.103":"Never again worry about item entities crashing your game!",
	"quests.title.32":"Checked",
	"quests.title.33":"String Duper",
	"quests.desc.104":"You need to build a lot of stuff to progress MCA.",
	"quests.desc.105":"So we added this mod to help you build.",
	"quests.desc.106":"Press V to switch mode and Press Y to open GUI.",
	"quests.desc.107":"Or you could use the Schematicannon from create.",
	"quests.desc.108":"This modpack comes with some blueprints or you can use your own.",
	"quests.title.34":"Building Wands!",
	"quests.desc.109":"The heart system of Minecraft Comes Alive is, in fact, mostly works around gifting. Since talking have a chance of failure, a restriction for spam, a penalty for failure and only few hearts for an actual success, spamming villagers with trash is much more faster...",
	"quests.desc.110":"The best gifts in early stages could be simple tools and food, however MCA have a cursed feature...",
	"quests.desc.111":"",
	"quests.desc.112":"Netherite hoe have an interal gift value of +1000.",
	"quests.desc.113":"For comparison, netherite blocks only have +100...",
	"quests.desc.114":"Giving a netherite hoe to a random villager could immediately raise enough hearts for marriage, and after marriage you can just open their inventory to get your hoe back (which is extra cursed) and repeat this process. Then you can just divorce (which lowers the heart by just a bit...) and you can repeat the whole progress for a ton of total hearts...",
	"quests.title.35":"Fun MCA fact: The Netherite Hoe",
	"quests.desc.115":"This modpack disabled the nether portal, as nether expedition would damage the game stages and playing experiences. This cause some minor issues like you can't craft the resurgent soil. (but you can buy it from clerics",
	"quests.subtl.17":"Why can't I build a nether portal?",
	"quests.title.36":"What happened to the nether",
	"quests.desc.116":"At first glance this modpack is way too lightweighted: Just a couple dozens of mods and less playable contents than most modpacks. Aside from essential mods for modpacks like FTB or library mods, few mods are actually related to the gameplay.",
	"quests.desc.117":"We got just a couple 'Delight' mods, two 'Create' mods - Create itself and CCK - with no 'Let's do' mods.",
	"quests.desc.118":"",
	"quests.desc.119":"These five chapters are everything this modpack would provide, and any future updates will only include bug fixes and small improvements.",
	"quests.desc.120":"I'm not trying to create a grand masterpiece, but a proof for a simple fact:",
	"quests.desc.121":"It is possible to create a target, a gameplay, a motivation, for a relaxing modpack.",
	"quests.desc.122":"It is possible to create real business simulation.",
	"quests.desc.123":"",
	"quests.desc.124":"Many relaxing/farming modpacks have fell into this vicious cycle:",
	"quests.desc.125":"Hundreds of mods that provides hundreds of things to do: In one of those modpacks, there's always something to be done. Collecting new seeds or cooking new cuisines...",
	"quests.desc.126":"But... one wouldn't want to do so.",
	"quests.desc.127":"Or, one doesn't know what to do anymore.",
	"quests.desc.128":"A lack of motivation.",
	"quests.desc.129":"At first the unfinished quests in the FTB quests could be motivative but eventually... They fail to entertain us.",
	"quests.desc.130":"What's the last time you collected everything in such farming modpack before quitting?",
	"quests.desc.131":"",
	"quests.desc.132":"But it don't have to be this way.",
	"quests.desc.133":"I believe there are someone with better ideas, better coding skills. I believe this is not what the modpack community is missing, all we need is confidence, confidence for a possibility.",
	"quests.desc.134":"Since it is possible to create a burgeria with KubeJS, why couldn't we make a stir-fry restaurant with Cuisine Delight?",
	"quests.desc.135":"Maybe a bar modpack, with beverages from all the brewing mods - Maybe a replica of 'Touhou Mystia's Izakaya' but in Minecraft?",
	"quests.desc.136":"",
	"quests.desc.137":"Anyone can freely use, distribute or modify all the KubeJS codes in this modpack.",
	"quests.desc.138":"I have written comments for those who wish to read. (but they are in Chinese.)",
	"quests.desc.139":"You can find tutorials in KubeJS official discord server.\\nIt's not that hard.",
	"quests.subtl.18":"Please read this",
	"quests.title.37":"Leading to something more.",
	"quests.desc.140":"Resourceful Tools",
	"quests.desc.141":"This mod comes with lots of tools and recipes.",
	"quests.desc.142":"Use show recipe (default by U) on the tools reveals what resources these tools could harvest.",
	"quests.title.38":"Collect unique resources from leaves and stone!",
	"quests.desc.143":"This modpack is made around the mod &eSome Assembly Required&r.",
	"quests.desc.144":"This mod lets you assemble highly customizable sandwiches, and here you can make customized burgers to fulfill the orders!",
	"quests.desc.145":"First of all, there's a &esandwiching station&r to the left of your counter. Slice the burger buns and right click the sandwiching station with burger bun bottom to start assembling.",
	"quests.desc.146":"Right click sandwiching station or the burger above with burger ingridents adds the ingrident to &ethe top&r.",
	"quests.desc.147":"&eRight click with empty hands&r removes the top ingrident.",
	"quests.desc.148":"When it's done, hold left click to break the burger (or right click with spade) to turn it into a burger item for delivery.",
	"quests.subtl.19":"SAR!",
	"quests.title.39":"Checked",
	"quests.title.40":"How to Assemble Your Burgers",
	"quests.desc.149":"When delivering an order with any &eextra product&r in your inventory,",
	"quests.desc.150":"Then there's a chance for customers to randomly buy one.",
	"quests.desc.151":"&eThe chance of buying extra products increases with the variety of extra products.&r",
	"quests.desc.152":"Extra products could modify the reputation and cash gain of orders.",
	"quests.desc.153":"Therefore, when you're short on cash yet not rushing for reputation, you could choose the ones that decrease reputation gain but increase cash gain. And vise versa.",
	"quests.title.41":"Extra Product?",
	"quests.desc.154":"Possible future sequels:",
	"quests.desc.155":"Bar (Now Coding)",
	"quests.desc.156":"&mPizza Joint (Abandoned and merged with burgeria)&r",
	"quests.desc.157":"Sushi Island (Done! yet to be translated to English)",
	"quests.subtl.20":"Not satisfied yet?",
	"quests.title.42":"Future plans",
	"quests.desc.158":"Q: How to spawn / recruit villagers?",
	"quests.desc.159":"A: &eSelect add room&r with blueprint in your inn, which should show a rabbit stew icon on blueprint, then choose talk -> ask to stay once villagers arrived, until they become unemployed villagers.",
	"quests.desc.160":"",
	"quests.desc.161":"Q: How do I obtain a certificate?",
	"quests.desc.162":"A: Right click the counter with paper.",
	"quests.desc.163":"",
	"quests.desc.164":"Q: Is there a way to use shader with create machines?",
	"quests.desc.165":"A：You could try the mod &eOculus Flywheel Compat&r",
	"quests.desc.166":"This mod adds compatibility to create mod and shaders. For some reason this mod cause crashes on my machine so this modpack don't come with it.",
	"quests.desc.167":"",
	"quests.desc.168":"Q: How to create new islands for my friends?",
	"quests.desc.169":"A: /skyblock create",
	"quests.desc.170":"",
	"quests.desc.171":"Q: My server somehow have regular overworld terrain!",
	"quests.desc.172":"A：Change level-type in server.properties to skyblockbuilder:skyblock , or upload a skyblock save.",
	"quests.desc.173":"",
	"quests.desc.174":"Q: My reputation is stuck!",
	"quests.desc.175":"A: Maybe your ingridents of choice are temporarily unpopular or you lack three different ingridents of new chaper in your menu.",
	"quests.title.43":"Common Q\\\u0026A.",
	"quests.desc.176":"You can find 'example_mod.js' in kubejs/server_scripts/mods.",
	"quests.desc.177":"Which is a template for registering new ingridents, extra products and rare customers in new script files.",
	"quests.subtl.21":"Template Mod",
	"quests.title.44":"Checked",
	"quests.title.45":"Wish to Add Something?",
	"quests.desc.178":"Brooms could also dismiss adventurers, like customers, but cannot dismiss villagers with professions.",
	"quests.desc.179":"This is where you could craft these baggage which can be used to dismiss them.",
	"quests.desc.180":"Please note that baggage can dismiss all entities, not just villagers.",
	"quests.desc.181":"To prevent accidental usage, right click for the first time just shows warnings, only right click twice on the same mob in a short time would dismiss them.",
	"quests.title.46":"Checked",
	"quests.title.47":"Dismiss the Villagers You Don't Like",
	"quests.desc.182":"Break dark oak leaves with trimmer.",
	"quests.title.48":"I need ender pearls for tom's storage!",
	"quests.desc.183":"You can build customized vehicles with Automobility mod: Craft engines, frames, wheels and other car parts on auto mechanic table, then assemble them on automobile assembler. Crowbars are used when you want to disassemble your vehicle.",
	"quests.desc.184":"In lager stages your island may be expanded too big for walking, so you can build vehicles. Besides, this mod provides a fully functional tractor if you don't like the create mod.",
	"quests.title.49":"Customize Your Cart!",
	"quests.desc.185":"When dealing with annoying &8&m(or glitched)&r customers, you can dismiss them by right click with brooms.",
	"quests.desc.186":"Also brooms can dismiss excessive adventurer villagers. (shift+right click to avoid open chat gui)",
	"quests.title.50":"Checked",
	"quests.title.51":"Dismiss Customers You Don't Like",
	"quests.desc.187":"Build a wall of &edrawers&r is helpful for burger building.",
	"quests.desc.188":"To store items, right click, to take items, left click. Shift+right click to store all, shift+left click to take a stack. ",
	"quests.desc.189":"I would recommend 2x2 drawers.",
	"quests.title.52":"Checked",
	"quests.title.53":"Easier Ingrident Storage",
	"quests.desc.190":"In the end pizza joint contents are added into this modpack.",
	"quests.desc.191":"Pizzas are more complicated to make than burgers, but they cost less ingridents.",
	"quests.desc.192":"Selling pizzas may yield less income per day, but surely more income per ingrident.",
	"quests.desc.193":"Also, some less valuable burger ingridents may be great for pizzas.",
	"quests.desc.194":"Craft these special doughs before making pizzas.",
	"quests.desc.195":"Then place down the dough and right click with or without a rolling pin until it turns flat.",
	"quests.title.54":"Start Your Pizza Business!",
	"quests.desc.196":"Pizza sauces are essential for your pizza business.",
	"quests.desc.197":"To start selling pizzas, put dough, at least one type of base sauce, two types of primary and secondary ingridents in your list filter.",
	"quests.desc.198":"Since baking pizzas takes time, customers would work differently: You may take multiple orders.",
	"quests.desc.199":"Right click customers instead of the counter to write down and deliver orders.",
	"quests.desc.200":"",
	"quests.desc.201":"Now with orders waiting to be fulfilled, time to assemble and bake pizzas.",
	"quests.desc.202":"To put ingridents on pizzas, right click pizza holding ingridents according to the order sequence.",
	"quests.desc.203":"Then, use a pizza peel to pick up the raw pizza.",
	"quests.desc.204":"You can put raw pizzas on top of any heat sources, or you can craft these fancy pizza ovens. They're not faster but would make you appear professional.",
	"quests.desc.205":"Once it's done, pick up the cooked pizza with pizza peel for delivery.",
	"quests.title.55":"Making \\& Baking Pizzas",
	"quests.desc.206":"&eBase, primary ingridents and secondary ingridents&r are the three ingrident type of pizzas.",
	"quests.desc.207":"&eBase&r determine a multiplier for price: torchflower pizza sauce would increase the pizza price by 200%.",
	"quests.desc.208":"Other ingridents are similar to burger ingridents but they don't have &eodds to end order&r.",
	"quests.desc.209":"Customer would pick a base by random, before picking &eprimary and secondary ingridents&r in turns by random, until reached maximum size or picked an ingrident twice.",
	"quests.desc.210":"Therefore, &eall ingridents would only appear once per order&r, and &esize of the menu heavily affects size of orders.&r",
	"quests.title.56":"Checked",
	"quests.title.57":"Know Your Pizza Ingridents",
	"quests.subtl.22":"Here's a set of free chef suit!",
	"quests.title.58":"Checked",
	"quests.title.59":"A Qualified Pizza Chef!",
	"quests.desc.211":"You gain one Combo upon delivering an 100% correct order.",
	"quests.desc.212":"Combos could stack if another correct order is delivered within 60s.",
	"quests.desc.213":"Employees could not gain combos.",
	"quests.desc.214":"Each Combo level boost reputation gain by 10%.",
	"quests.subtl.23":"Keep up with the pace for more reputation!",
	"quests.title.60":"Checked",
	"quests.title.61":"Combos",
	"quests.desc.215":"If you still don't understand after reading the quests, you can ask Rumia!",
	"quests.desc.216":"By typing '露米娅' in chat, you can ask her to answer your questions!",
	"quests.desc.217":"You can also feed Rumia by right clicking her with food in hand.",
	"quests.desc.218":"&c&bTODO: Add English Vairent. I can't just use minecraft's default translation function since I need to slice the text for painter API.",
	"quests.subtl.24":"Cute little monster",
	"quests.title.62":"Checked",
	"quests.title.63":"Get your Rumia!",
	"quests.desc.219":"In 2.0 version we added rare customers... but just a few! Besides, you may wish to add some other rare customers to the game, like your friends, your favourite youtubers, or your anime waifu...",
	"quests.desc.220":"... Therefore, rare customers are 100% customizable!",
	"quests.desc.221":"",
	"quests.desc.222":"Step one: Prepare a minecraft skin file for your rare customer and put it in version\\config\\easy_npc\\skin\\humanoid中；",
	"quests.desc.223":"",
	"quests.desc.224":"Step two: In creative mode, shift + right click any customer npc, choose Edit skin, Reload Textures, then pick the skin you wish.",
	"quests.desc.225":"",
	"quests.desc.226":"Step three: Right click with the skin scanner (creative mode item), the UUID of said skin is revealed in logs\\kubejs\\server.log;",
	"quests.desc.227":"",
	"quests.desc.228":"Step four: With the UUID, you could customize your very own customer using the template in server_scripts\\mods\\example_mod.js! All rare customers in global list will appear at random!",
	"quests.desc.229":"",
	"quests.desc.230":"P.S: It's highly recommended to set isIgnoredByEmployees to true if you want your rare customer to order something not on the menu, otherwise it might clog the employee workflow.",
	"quests.title.64":"Checked",
	"quests.title.65":"Guide to Customized Rare Customer!",
	"quests.desc.231":"&eEvery six hours in real life&r, one of each ingrident catagories would be rendered as &e'popular'&r and &e'unpopular'&r.",
	"quests.desc.232":"Popular ingridents yield double cash and reputation gain; Unpopular ingridents cannot gain reputation (cash gain is not affected).",
	"quests.desc.233":"It could be choose from veggies, meat, sauce, misc hamburger ingridents,",
	"quests.desc.234":"or primary and secondary pizza ingridents, which sums up as six categories that could be affected.",
	"quests.desc.235":"Right click with a newspaper to check the current trend.",
	"quests.title.66":"Checked",
	"quests.title.67":"Random Events!",
	"quests.title.68":"Begin Your Journey",
	"quests.title.69":"Begin Chapter 3",
	"quests.title.70":"Begin Chapter 4",
	"quests.desc.236":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.237":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.238":"to bind workstations.",
	"quests.title.71":"Buy Exotic Animals \\\u0026 Crops From Cartographer!",
	"quests.desc.239":"",
	"quests.subtl.25":"Portobello must be planted on rich soil in dark places.",
	"quests.desc.240":"Now, you can recruit employees to build your burgers for you!",
	"quests.desc.241":"Employees, when across from customers (on the exact block north to counter), would automatically assemble burgers and pizzas for you.",
	"quests.desc.242":"Employees would take ingridents from the block on the left (any given container), and store the money to the block on the right (any given container).",
	"quests.desc.243":"When selling pizzas, employees will use oven-like blocks within two blocks of the right and left to the counter.",
	"quests.desc.244":"Right click any mob with contracts to recurit them as employee of corresponding level. (Consumes contract.)",
	"quests.desc.245":"You can find employee level and working status in Jade interface.",
	"quests.desc.246":"Right click with brass hand to switch working status.",
	"quests.desc.247":"In this stage, employees work much slower than you could...",
	"quests.desc.248":"But now, you can still set up business when farming crops or building machines!",
	"quests.subtl.26":"Redbean could be directly planted on rich soil.",
	"quests.title.72":"Chapter 3: Exotic Delicacies",
	"quests.title.73":"Begin Chapter 5",
	"quests.desc.249":"终极的自动汉堡机！",
	"quests.title.74":"The End of Your Journey",
	"quests.desc.250":"Right click sniffers with chests to equip chests. Sniffers with chests stores the seeds they dig up in chests.",
	"quests.subtl.27":"I may have made encough content for a 'sniffer's delight'.",
	"quests.title.75":"Bring Back The Prehistoric...",
	"quests.desc.251":"Udumbera only grows in moonlight, they must have a roof in daytime or they would reverse growth.",
	"quests.desc.252":"They only bloom under a full moon and the bloom only last ten seconds.",
	"quests.desc.253":"Fiddlefern can be duplicated with bone meal!",
	"quests.desc.254":"You can craft a new counter with diamond certificate!",
	"quests.desc.255":"New counters starts with zero reputation, but it could be used to sell excessive ingridents in early chapters.",
	"quests.desc.256":"Note: Counters can't be placed too close to each other.",
	"quests.title.76":"A Branch Business!",
	"quests.title.77":"Chapter 5: Bring Back the Prehistoric",
	"quests.desc.257":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.28":"Sells ores and minerals.",
	"quests.title.78":"Weaponsmith",
	"quests.desc.258":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.29":"Sells building materials.",
	"quests.title.79":"Mason",
	"quests.title.80":"Any #minecraft:terracotta",
	"quests.title.81":"Colored Concretes",
	"quests.title.82":"Any #quark:corundum",
	"quests.desc.259":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.30":"Chapter 1",
	"quests.title.83":"Farmer",
	"quests.desc.260":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.31":"Chapter 1",
	"quests.title.84":"Butcher",
	"quests.desc.261":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.32":"Chapter 2",
	"quests.title.85":"Fisherman",
	"quests.desc.262":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.33":"Chapter 3",
	"quests.title.86":"Cartographer",
	"quests.desc.263":"Each layer of quests below represent each level of villager trades of this profession.",
	"quests.subtl.34":"Chapter 4",
	"quests.title.87":"Cleric",
	"quests.subtl.35":"Sells dyes.",
	"quests.title.88":"Shepherd",
	"quests.desc.264":"Adventurers comes with two trades.",
	"quests.title.89":"Checked",
	"quests.title.90":"Adventurer",
	"quests.subtl.36":"Trade with Fletchers for emeralds!",
	"quests.title.91":"Any profession not listed here is not modified",
	"quests.title.92":"List of Villager Trades",
	"quests.desc.265":"Technically, some contents of this chapter and the next one aren't only obtainable through villager trading.",
	"quests.desc.266":"It is possible to apply regular skyblock techniques to farm fish and animals from natural spawning or acquire potatos and carrots from a mob farm.",
	"quests.desc.267":"However villager trading is much easier.",
	"quests.title.93":"Begin Chapter 1",
	"quests.desc.268":"Once you entered a new chapter, you must add new ingridents to your menu for further progression.",
	"quests.desc.269":"Specifically, at least &ethree&r unique ingridents of new chapter must be included in your menu to progress in reputation.",
	"quests.subtl.37":"Right click counter with paper to obtain certificates.",
	"quests.title.94":"Begin Chapter 2",
	"quests.desc.270":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.271":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.272":"to bind workstations.",
	"quests.title.95":"Buy new crops from Farmers!",
	"quests.desc.273":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.274":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.275":"to bind workstations.",
	"quests.title.96":"Buy new animals from Butchers!",
	"quests.subtl.38":"Right click bamboo shoots with shovels to dig up bamboo shoot items.",
	"quests.desc.276":"Water buckets can be smelted into salt buckets, which can be crafted into three salt dusts.",
	"quests.desc.277":"Salt blocks can be crafted from nine salt dusts. Evaporators can be crafted from salt blocks. Evaporators and salt blocks can 'grow' salt when placed next to water.",
	"quests.desc.278":"Salt dusts can be used for some sauces or snacks, or used to pickle ingridents.",
	"quests.desc.279":"Fermenating jars could pickle ingridents, which is important in chapter 1 and 3.",
	"quests.desc.280":"Place the ingridents in fermenating jars according to recipes for pickles.",
	"quests.desc.281":"Typically, it takes four minutes to make five pickles which can then be sliced into ten burger materials.",
	"quests.title.97":"Pickle Up",
	"quests.desc.282":"Cheese have one of the longest crafting tree among all ingridents.",
	"quests.desc.283":"First you need jam (at least requires sugar) for crafting vinegar (which requires mushroom), then you cook cheese curds from vinegar, salt and milk (which obviously requires milk), put the curds in a mold, wait for it to change colors, then right click to grab cheese wheels, after that you can finally slice them down to cheese slices.",
	"quests.title.98":"Cheese Production",
	"quests.desc.284":"Mushrooms form colonies on rich soil, right click with shears to harvest mushroom.",
	"quests.subtl.39":"Mushrooms form colonies on rich soil.",
	"quests.title.99":"Any #forge:mushrooms",
	"quests.title.100":"Mushroom Farming",
	"quests.subtl.40":"Rice must be planted in one-block deep water pool.",
	"quests.title.101":"Rice Farming",
	"quests.title.102":"Chapter 1: The Classic Recipe",
	"quests.title.103":"Begin Chapter 4",
	"quests.title.104":"Begin Chapter 5",
	"quests.desc.285":"Keep in mind that MCA villagers does not actively seek workstations.",
	"quests.desc.286":"You should Right Click->Interact->Locations->Workplace",
	"quests.desc.287":"to bind workstations.",
	"quests.title.105":"Buy other dimensions' animals and crops from clerics!",
	"quests.desc.288":"Must be planted on end stone.",
	"quests.subtl.41":"Could multiply using bone meal.",
	"quests.subtl.42":"Peppers are harvested with knives.",
	"quests.desc.289":"Now, hoglins won't turn into zombies in overworld.",
	"quests.desc.290":"But they are still hostile in non-peaceful mode, and they deal quite some damage.",
	"quests.subtl.43":"Breed with crimson fungus.",
	"quests.desc.291":"Striders receive damage from water.",
	"quests.desc.292":"So build a roof if you raise them in biomes that rains.",
	"quests.subtl.44":"Breed with warped fungus.",
	"quests.subtl.45":"Right click with knives to harvest bullet peppers from powdery cannons.",
	"quests.subtl.46":"Cut bullet peppers on cutting boards to produce blaze powders.",
	"quests.subtl.47":"Compact powders into blaze rods.",
	"quests.title.106":"Chapter 4: From Another Dimension"
}